raquenaengineering/firm_test_stm32C0116/test_stm32C0116/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "adc.h"
#include "i2c.h"
#include "spi.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32c0xx_hal.h"
#include "stm32c0xx_hal_i2c.h"
#include "stm32c0xx_hal_i2c_ex.h"
#include "tim.h"


#include "stdio.h"

#include "MLX90614.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
void I2C_Scanner(void);
void Set_PWM_From_Analog(uint32_t adc_value);
void Set_LED_From_Analog(uint32_t adc_value);



/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

// Retarget printf to UART
int _write(int file, char *ptr, int len) {
    HAL_UART_Transmit(&huart1, (uint8_t*)ptr, len, HAL_MAX_DELAY);
    return len;
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  float obj_temp, amb_temp;

  MLX90614_Init(&hi2c1);  // Initialize sensor

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();
  MX_SPI1_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */
  MX_TIM3_Init();								// why not autogenerated by cubemx ???
  HAL_TIM_PWM_Start(&htim3,TIM_CHANNEL_1);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */


  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

	// ADC RELATED //
	HAL_ADC_Start(&hadc1);                     // Start conversion
	HAL_ADC_PollForConversion(&hadc1, 10);     // Wait until done
	uint32_t adc_value = HAL_ADC_GetValue(&hadc1);      // Read value
	printf("ADC: %lu\r\n", adc_value);
	HAL_Delay(100);


//	// I2C RELATED //
////	printf("Performing i2c scan:\r\n");
//	I2C_Scanner();
////	printf("Done\r\n");
//	HAL_Delay(100);


	// PWM RELATED //
	Set_PWM_From_Analog(adc_value);



	// MLX90614 RELATED //
//    obj_temp = MLX90614_GetTemp(&hi2c1, 0);  // Read Object 1 temp (°C)
//    amb_temp = MLX90614_GetTemp(&hi2c1, 1);  // Read Ambient temp (°C)

    obj_temp = MLX90614_GetTemp(&hi2c1, 0);
    int obj_temp_int = (int)(obj_temp * 100);  // e.g., 25.50°C → 2550
    printf("Temperature: %d.%02d°C\r\n", obj_temp_int / 100, obj_temp_int % 100);

//    printf("Object Temp: %.2f°C, Ambient Temp: %.2f°C\r\n", obj_temp, amb_temp);
    HAL_Delay(1000);  // Read every 1 second


  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  __HAL_FLASH_SET_LATENCY(FLASH_LATENCY_1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */

// Replace with your I2C handle (e.g., hi2c1)
//extern I2C_HandleTypeDef hi2c1;

#define I2C_TIMEOUT 100 // Timeout in ms

void I2C_Scanner(void) {
    HAL_StatusTypeDef status;
    uint8_t address = 0;
    uint8_t data = 0;

    printf("Scanning I2C bus for devices...\r\n");

    for (address = 1; address < 127; address++) {
        status = HAL_I2C_Master_Transmit(&hi2c1, (address << 1), &data, 1, I2C_TIMEOUT);
        if (status == HAL_OK) {
//        	char msg1[] = "Found device at address: 0x%02X\r\n";
//			HAL_UART_Transmit(&huart1, (uint8_t*)msg1, sizeof(msg1)-1, HAL_MAX_DELAY);

			printf("Found device at address: 0x%02X\r\n", address);
        }
        HAL_Delay(10); // Small delay between scans
    }
    printf("Scan complete.\r\n");
}

// Function to map ADC value (0-4095) to PWM duty cycle (0-100%)
void Set_PWM_From_Analog(uint32_t adc_value) {
    // Map ADC value (0-4095) to PWM pulse (0-TIM_ARR)
    uint32_t pwm_pulse = (adc_value * htim3.Instance->ARR) / 4095;

    // Update PWM duty cycle
    __HAL_TIM_SET_COMPARE(&htim3, TIM_CHANNEL_1, pwm_pulse);
}

void Set_LED_From_Analog(uint32_t adc_value){
		// GPIO RELATED //
		if(adc_value < 1000)
		{
			HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);
	//		HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
			HAL_Delay(500);
			HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET);
	//		HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
			HAL_Delay(500);
		}
}



/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}
#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
